# Chapter includes - Pandas Tutorial
importing pandas 
2.Read Data 
3.df.count for display data frame 
4.df.head for top values display in row wise
5.df.columns for columns wise
Adding new columns in data frame
df.describe

In [1]:
import pandas as pd 
import numpy as np

In [7]:
# Creation of dictionary 

mydict= {'Name':['Harry','John','Sia'],
         'Marks':[59,78,90],
         'City':['Bhopal','Delhi','Mumbai']}
         
mydict

{'Name': ['Harry', 'John', 'Sia'],
 'Marks': [59, 78, 90],
 'City': ['Bhopal', 'Delhi', 'Mumbai']}

# Data Frame 

Creation of data in form of excel which make fast processing

In [8]:
# Creation  of Data Frames 


df=pd.DataFrame(mydict)  
df

    Name  Marks    City
0  Harry     59  Bhopal
1   John     78   Delhi
2    Sia     90  Mumbai

In [12]:
# Convert data frame into CSV file 
df.to_csv('myfirsdict.csv')

In [20]:
# How to read CSV file from Folder or Desktop 

df1= pd.read_csv('Health.csv')

In [14]:
df1

  Ethnicity  Height (CM)  Weight (Kg) Will survive till 70
0     White        186.0         90.0                  Yes
1   African        185.0         98.0                   No
2     Asian        175.0         80.0                   No
3     White        180.0         88.0                  Yes
4     Asian        178.0          NaN                   No
5     Asian        172.0         72.0                  Yes
6   African        178.0         75.0                   No
7     White          NaN         89.0                  Yes
8   African        186.0         90.0                  Yes

In [15]:
df1.describe()

       Height (CM)  Weight (Kg)
count     8.000000     8.000000
mean    180.000000    85.250000
std       5.264436     8.762746
min     172.000000    72.000000
25%     177.250000    78.750000
50%     179.000000    88.500000
75%     185.250000    90.000000
max     186.000000    98.000000

In [17]:
df1.head()

  Ethnicity  Height (CM)  Weight (Kg) Will survive till 70
0     White        186.0         90.0                  Yes
1   African        185.0         98.0                   No
2     Asian        175.0         80.0                   No
3     White        180.0         88.0                  Yes
4     Asian        178.0          NaN                   No

In [18]:
df1.tail()

  Ethnicity  Height (CM)  Weight (Kg) Will survive till 70
4     Asian        178.0          NaN                   No
5     Asian        172.0         72.0                  Yes
6   African        178.0         75.0                   No
7     White          NaN         89.0                  Yes
8   African        186.0         90.0                  Yes